# ManyWarnings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectionValidationInfo..::..ManyWarnings Method
ConnectionValidationInfo Class See Also
---
Returns number of warnings generated by reload.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int ManyWarnings()
```

Visual Basic
---
```text
Public Function ManyWarnings As Integer
```

Visual C++
---
```text
public:
int ManyWarnings()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
ConnectionValidationInfo Class
Autodesk.Revit.DB Namespace